intern_activites/week1.tex
% Created 2021-06-11 Fri 21:06
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{Week 1 Activity}
\hypersetup{
 pdfauthor={},
 pdftitle={Week 1 Activity},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.6)},
 pdflang={English}}
\begin{document}

\maketitle
\section*{Activities done this week}
\label{sec:org6a54064}
\subsection*{Day 2}
\label{sec:orge570dfe}
\subsubsection*{Working time}
\label{sec:orgc1f9d39}
\textit{<2021-06-08 Tue 09:30> } to \textit{<2021-06-08 Tue 14:30>}
\subsubsection*{Things done}
\label{sec:org40645d5}
\begin{itemize}
\item Watced a video for  all the key details in breif of the technical concepts. These concepts were essential in understanding how WebRTC technology works.
\end{itemize}

\subsection*{Day 3}
\label{sec:org7d8487d}
\subsubsection*{Working time}
\label{sec:orgaa7bbad}
\textit{<2021-06-09 Wed 09:30> } to \textit{<2021-06-09 Wed 14:30>}
\subsubsection*{Things done}
\label{sec:orgb3ba90b}
\begin{itemize}
\item Notes made for all the new terms and concepts learnt, so that I can refer to it again as need be.
\item Started working on the initial documentation, jotting down all the requirements.
\end{itemize}

\subsection*{Day 4}
\label{sec:org8686365}
\subsubsection*{Working time}
\label{sec:org8737acd}
\textit{<2021-06-10 Thu 09:30> } to \textit{<2021-06-10 Thu 14:30>}
\subsubsection*{Things done}
\label{sec:org863a890}
\begin{itemize}
\item Set up a git remote repo with an active workflow with local repo, so that during the implementation phase, I can implement and push the feature directly to remote, for safety and organization purposes. Made tech mentor collaborator in repo.
\item Learnt how to make two local browsers communicate with each other by sending text streams.
\end{itemize}

\subsection*{Day 5}
\label{sec:orge735228}

\subsubsection*{Working time}
\label{sec:org2319456}
\textit{<2021-06-11 Fri 08:30> } to \textit{<2021-06-11 Fri 12:30>}

\subsubsection*{Things done}
\label{sec:org5becaae}
\begin{itemize}
\item Worked on how we can make two local browsers send media streams between each other.
\end{itemize}

\section*{This week's achievements}
\label{sec:org88953ec}
\subsection*{{\bfseries\sffamily DONE} Set up a working git repo, for seamless workflow.}
\label{sec:orga1664fe}
\subsection*{{\bfseries\sffamily DONE} Set up and hosted the initial documentation file}
\label{sec:org6191f0a}
\subsection*{{\bfseries\sffamily DONE} Made two local browser send text data between themselves.}
\label{sec:org8a43a72}
\section*{Next week's goals}
\label{sec:org708801b}
\subsection*{{\bfseries\sffamily TODO} Make two local browsers send media data between themselves.}
\label{sec:orge0b7e5e}
\subsection*{{\bfseries\sffamily TODO} Make two browers in different networks send text data between themselves.}
\label{sec:orgfe25e75}
\subsection*{{\bfseries\sffamily TODO} Make two browers in different networks send media data between themselves.}
\label{sec:orgbb48761}
\end{document}